import random as r

def print_game():
    print("""
  _____           __  __  _____
 / ____|    /\   |  \/  ||  ___| 
| |        /  \  | \  / || |___  
| |  __   / /\ \ | |\/| ||  ___| 
| |_|  | / ____ \| |  | || |___
 \_____//_/    \_\_|  |_||_____|
""")
    
def print_end_game():
    print("""
        ______   __    __   _______            _____           __  __  _____
       |   ___| |  \  |  | |   __  \          / ____|    /\   |  \/  ||  ___| 
       |  |___  |   \ |  | |  |  |  |        | |        /  \  | \  / || |___  
       |   ___| |    \|  | |  |  |  |        | |  __   / /\ \ | |\/| ||  ___| 
       |  |___  |  |\    | |  |__|  |        | |_|  | / ____ \| |  | || |___
       |______| |__| \ __| |_______/          \_____//_/    \_\_|  |_||_____|
""")

def rules():
    print("""Правила игры:
Загадано случайное число от 1 до 1000
Ваша задача отдагать это число.
        """)

def print_():
    print()
    
numbers = r.randint(1,1000)  #генерируется случайное число
print("    Добро пожаловать в игру")
print_game()
rules()
print_()
print("ПОЕХАЛИ")


#num_user = int(input("Введите загаданное число:"))
a = False
count = 0
while a==False:
    num_user = int(input("Введите загаданное число:"))
    count+=1
    if num_user>=1 and num_user<=1000:
        if num_user==numbers:
            print("Поздравляю, ты угадал")
            print(f'Попыток:{count}')
            break
        elif num_user<numbers:
            print_()
            print("Загаданое число больше")
        elif num_user>numbers:
            print_()
            print("Загаданое число меньше")
    else:
        print("Ай-ай-ай, ввел число не в том диапазоне")

print_end_game()